In [1]:
import pandas as pd

In [16]:
df_cambio = pd.DataFrame({
    'moeda': ['dolar/real','libra/real'] * 2,
    'price': [5.24,4.15,5.26,4.23],
    'data': sorted(list(pd.date_range('1/5/2015', periods = 2)) * 2)
})

df_cambio

        moeda  price       data
0  dolar/real   5.24 2015-01-05
1  libra/real   4.15 2015-01-05
2  dolar/real   5.26 2015-01-06
3  libra/real   4.23 2015-01-06

In [17]:
# Como trocar o nome das colunas

df_cambio.columns

df_cambio.columns = ['moeda','cotacao','data']

df_cambio

        moeda  cotacao       data
0  dolar/real     5.24 2015-01-05
1  libra/real     4.15 2015-01-05
2  dolar/real     5.26 2015-01-06
3  libra/real     4.23 2015-01-06

In [18]:
# Como selecionar colunas

cotacao = df_cambio['cotacao'] # te devolve uma serie

cotacao

0    5.24
1    4.15
2    5.26
3    4.23
Name: cotacao, dtype: float64

In [19]:
df_cambio.cotacao # Pode selecionar colunas assim também

0    5.24
1    4.15
2    5.26
3    4.23
Name: cotacao, dtype: float64

In [20]:
#2 colunas

cotacao_e_data = df_cambio[['cotacao','data']] # Listra dentro da lista

cotacao_e_data

   cotacao       data
0     5.24 2015-01-05
1     4.15 2015-01-05
2     5.26 2015-01-06
3     4.23 2015-01-06

In [21]:
# Vantagem da data como índice

df_cambio = df_cambio.set_index('data')

cotacao = df_cambio['cotacao']

cotacao

data
2015-01-05    5.24
2015-01-05    4.15
2015-01-06    5.26
2015-01-06    4.23
Name: cotacao, dtype: float64

In [22]:
# Selecionando colunas por condições

cambio_menor_que_5 = df_cambio[df_cambio['cotacao'] < 5]

cambio_menor_que_5

                 moeda  cotacao
data
2015-01-05  libra/real     4.15
2015-01-06  libra/real     4.23

In [24]:
# selecionando o cambio

cambio_dolar = df_cambio[df_cambio['moeda'] == 'dolar/real']

cambio_dolar

                 moeda  cotacao
data
2015-01-05  dolar/real     5.24
2015-01-06  dolar/real     5.26

In [30]:
# Selecionando duas condições ao mesmo tempo

#dolar e maior que 5.25

cambio_dolar_e_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'dolar/real') & (df_cambio['cotacao'] > 5.25)]
cambio_dolar_e_maior_que_525

                 moeda  cotacao
data
2015-01-06  dolar/real     5.26

In [31]:
#Libra ou maior que 5.25

cambio_libra_ou_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'libra/real') | (df_cambio['cotacao'] > 5.25)]
cambio_libra_ou_maior_que_525

                 moeda  cotacao
data
2015-01-05  libra/real     4.15
2015-01-06  dolar/real     5.26
2015-01-06  libra/real     4.23

In [33]:
# Podemos filtrar o indice também

# Libra no dia 5 de janeiro de 2015

libra_5_jan = df_cambio[(df_cambio['moeda'] == 'libra/real') & (df_cambio.index == '2015-01-05')]
libra_5_jan

                 moeda  cotacao
data
2015-01-05  libra/real     4.15

# Exercícios

- Exercício 40: Mude o nome da coluna do dataframe do exercício 39 de 'cotacoes' para 'precos'.

- Exercício 41: Selecione a coluna de preços do dataframe estudado.

- Exercício 42: Selecione as duas últimas colunas do dataframe estudado.

- Exercício 43: Selecione as informações da Petrobras no dataframe estudado.

- Exercício 44: Selecione apenas empresas com P/L menor que 20

- Exercício 45: Selecione empresas com P/L maior que 10 e volume maior que 2000.

- Exercício 46: Selecione empresas que a cotação seja maior que 20 ou o volume é maior que 4000.

In [38]:
# Exercício 40

dados_cotacoes = {
    'tickers': ["WEGE3", "PETR3", "VALE3", "PETR4","LREN3"],
    'cotacoes': [20, 30, 40, 12, 35],
    'nomes': ["Weg", "Petrobras", "Vale", "Petrobras", "Lojas Renner"],
    'preco_sobre_lucro': [25,6,12,7,25],
    'volume': [5000, 1000, 4000,7000,1200]
}

df = pd.DataFrame(dados_cotacoes, index = [0,1,2,3,4],
                 columns = ['nomes','tickers','cotacoes','preco_sobre_lucro','volume'])

df = df.set_index('tickers')
df.columns = ['nomes', 'precos', 'preco_sobre_lucro', 'volume']
df

                nomes  precos  preco_sobre_lucro  volume
tickers
WEGE3             Weg      20                 25    5000
PETR3       Petrobras      30                  6    1000
VALE3            Vale      40                 12    4000
PETR4       Petrobras      12                  7    7000
LREN3    Lojas Renner      35                 25    1200

In [39]:
# Exercício 41

df['precos']

# ou 

df.precos

tickers
WEGE3    20
PETR3    30
VALE3    40
PETR4    12
LREN3    35
Name: precos, dtype: int64

In [40]:
# Exercício 42

df[['preco_sobre_lucro','volume']]

         preco_sobre_lucro  volume
tickers
WEGE3                   25    5000
PETR3                    6    1000
VALE3                   12    4000
PETR4                    7    7000
LREN3                   25    1200

In [44]:
# Exercício 43

df_petrobras = df[(df.index == 'PETR3') | (df.index == 'PETR4')]
df_petrobras

             nomes  precos  preco_sobre_lucro  volume
tickers
PETR3    Petrobras      30                  6    1000
PETR4    Petrobras      12                  7    7000

In [45]:
# Exercício 44

df_empresas_preco_sobre_lucro_menor_que_20 = df[(df['preco_sobre_lucro'] < 20)]
df_empresas_preco_sobre_lucro_menor_que_20

             nomes  precos  preco_sobre_lucro  volume
tickers
PETR3    Petrobras      30                  6    1000
VALE3         Vale      40                 12    4000
PETR4    Petrobras      12                  7    7000

In [46]:
# Exercício 45:

df_empresas_preco_lucro_maior_que_10_e_volume_maior_que_2000 = df[(df['preco_sobre_lucro'] > 10) & (df['volume'] > 2000)]
df_empresas_preco_lucro_maior_que_10_e_volume_maior_que_2000

        nomes  precos  preco_sobre_lucro  volume
tickers
WEGE3     Weg      20                 25    5000
VALE3    Vale      40                 12    4000

In [48]:
# Exercício 46

df_empresas_cotacao_maior_que_20_ou_volume_maior_que_4000 = df[(df['precos'] > 20) | (df['volume'] > 4000)]
df_empresas_cotacao_maior_que_20_ou_volume_maior_que_4000

                nomes  precos  preco_sobre_lucro  volume
tickers
WEGE3             Weg      20                 25    5000
PETR3       Petrobras      30                  6    1000
VALE3            Vale      40                 12    4000
PETR4       Petrobras      12                  7    7000
LREN3    Lojas Renner      35                 25    1200